In [1]:
import jedi
import pandas as pd
jedi.__version__

'0.19.2'

In [2]:
df =pd.read_csv('employees.csv')

In [3]:
df

   EmpID    Name   Department  Age  Salary    JoinDate
0    101   Rahul   Production   35   55000  2016-04-12
1    102    Amit  Maintenance   42   62000  2014-09-23
2    103   Sneha      Quality   29   48000  2019-01-15
3    104   Pooja   Production   31   51000  2018-07-30
4    105  Vikram    Logistics   45   68000  2012-11-02
5    106    Neha      Quality   27   45000  2020-06-18

In [4]:
df.head()

   EmpID    Name   Department  Age  Salary    JoinDate
0    101   Rahul   Production   35   55000  2016-04-12
1    102    Amit  Maintenance   42   62000  2014-09-23
2    103   Sneha      Quality   29   48000  2019-01-15
3    104   Pooja   Production   31   51000  2018-07-30
4    105  Vikram    Logistics   45   68000  2012-11-02

In [5]:
df.tail()

   EmpID    Name   Department  Age  Salary    JoinDate
1    102    Amit  Maintenance   42   62000  2014-09-23
2    103   Sneha      Quality   29   48000  2019-01-15
3    104   Pooja   Production   31   51000  2018-07-30
4    105  Vikram    Logistics   45   68000  2012-11-02
5    106    Neha      Quality   27   45000  2020-06-18

In [6]:
df.dtypes

EmpID          int64
Name          object
Department    object
Age            int64
Salary         int64
JoinDate      object
dtype: object

In [7]:
df1= df[["Name","Salary","Age"]]
df1

     Name  Salary  Age
0   Rahul   55000   35
1    Amit   62000   42
2   Sneha   48000   29
3   Pooja   51000   31
4  Vikram   68000   45
5    Neha   45000   27

In [8]:
df1.to_csv('New_Eployees.csv')

In [9]:
import openpyxl
df1.to_excel('New_Employees.xlsx')

In [10]:
df2 = pd.read_excel('New_Employees.xlsx')
df2

   Unnamed: 0    Name  Salary  Age
0           0   Rahul   55000   35
1           1    Amit   62000   42
2           2   Sneha   48000   29
3           3   Pooja   51000   31
4           4  Vikram   68000   45
5           5    Neha   45000   27

In [11]:
df

   EmpID    Name   Department  Age  Salary    JoinDate
0    101   Rahul   Production   35   55000  2016-04-12
1    102    Amit  Maintenance   42   62000  2014-09-23
2    103   Sneha      Quality   29   48000  2019-01-15
3    104   Pooja   Production   31   51000  2018-07-30
4    105  Vikram    Logistics   45   68000  2012-11-02
5    106    Neha      Quality   27   45000  2020-06-18

In [12]:
df['Name'].sort_values()

1      Amit
5      Neha
3     Pooja
0     Rahul
2     Sneha
4    Vikram
Name: Name, dtype: object

In [13]:
df.sort_values(by="Name", ascending=False)

   EmpID    Name   Department  Age  Salary    JoinDate
4    105  Vikram    Logistics   45   68000  2012-11-02
2    103   Sneha      Quality   29   48000  2019-01-15
0    101   Rahul   Production   35   55000  2016-04-12
3    104   Pooja   Production   31   51000  2018-07-30
5    106    Neha      Quality   27   45000  2020-06-18
1    102    Amit  Maintenance   42   62000  2014-09-23

In [14]:
df.sort_values(by="Name", ascending=True).reset_index(drop=True)

   EmpID    Name   Department  Age  Salary    JoinDate
0    102    Amit  Maintenance   42   62000  2014-09-23
1    106    Neha      Quality   27   45000  2020-06-18
2    104   Pooja   Production   31   51000  2018-07-30
3    101   Rahul   Production   35   55000  2016-04-12
4    103   Sneha      Quality   29   48000  2019-01-15
5    105  Vikram    Logistics   45   68000  2012-11-02

In [15]:
df.sort_values(by="Department", ascending=True)

   EmpID    Name   Department  Age  Salary    JoinDate
4    105  Vikram    Logistics   45   68000  2012-11-02
1    102    Amit  Maintenance   42   62000  2014-09-23
0    101   Rahul   Production   35   55000  2016-04-12
3    104   Pooja   Production   31   51000  2018-07-30
2    103   Sneha      Quality   29   48000  2019-01-15
5    106    Neha      Quality   27   45000  2020-06-18

In [16]:
df.sort_values(by=["Department", "Salary"], ascending=[True, False])

   EmpID    Name   Department  Age  Salary    JoinDate
4    105  Vikram    Logistics   45   68000  2012-11-02
1    102    Amit  Maintenance   42   62000  2014-09-23
0    101   Rahul   Production   35   55000  2016-04-12
3    104   Pooja   Production   31   51000  2018-07-30
2    103   Sneha      Quality   29   48000  2019-01-15
5    106    Neha      Quality   27   45000  2020-06-18

In [17]:
df.sort_values(by=["Department", "Salary"], ascending=[True, True])

   EmpID    Name   Department  Age  Salary    JoinDate
4    105  Vikram    Logistics   45   68000  2012-11-02
1    102    Amit  Maintenance   42   62000  2014-09-23
3    104   Pooja   Production   31   51000  2018-07-30
0    101   Rahul   Production   35   55000  2016-04-12
5    106    Neha      Quality   27   45000  2020-06-18
2    103   Sneha      Quality   29   48000  2019-01-15

In [18]:
df[(df["Department"]=="Production") ]

   EmpID   Name  Department  Age  Salary    JoinDate
0    101  Rahul  Production   35   55000  2016-04-12
3    104  Pooja  Production   31   51000  2018-07-30

In [19]:
df[(df["Department"]=="Production") & (df["Age"]>31)]

   EmpID   Name  Department  Age  Salary    JoinDate
0    101  Rahul  Production   35   55000  2016-04-12

In [20]:
df[(df["Department"].isin(["Production","Quality"])) | (df["Age"]>31)]

   EmpID    Name   Department  Age  Salary    JoinDate
0    101   Rahul   Production   35   55000  2016-04-12
1    102    Amit  Maintenance   42   62000  2014-09-23
2    103   Sneha      Quality   29   48000  2019-01-15
3    104   Pooja   Production   31   51000  2018-07-30
4    105  Vikram    Logistics   45   68000  2012-11-02
5    106    Neha      Quality   27   45000  2020-06-18

In [21]:
df[df["Name"].str.startswith("R")]

   EmpID   Name  Department  Age  Salary    JoinDate
0    101  Rahul  Production   35   55000  2016-04-12

In [22]:
df[df["Department"].str.contains("log", case=False, na=False)]

   EmpID    Name Department  Age  Salary    JoinDate
4    105  Vikram  Logistics   45   68000  2012-11-02

In [30]:
df["JoinDate"]

0   2016-04-12
1   2014-09-23
2   2019-01-15
3   2018-07-30
4   2012-11-02
5   2020-06-18
Name: JoinDate, dtype: datetime64[ns]

In [23]:
pd.to_datetime(df["JoinDate"])

0   2016-04-12
1   2014-09-23
2   2019-01-15
3   2018-07-30
4   2012-11-02
5   2020-06-18
Name: JoinDate, dtype: datetime64[ns]

In [24]:
df["JoinDate"]=pd.to_datetime(df["JoinDate"])

In [25]:
df

   EmpID    Name   Department  Age  Salary   JoinDate
0    101   Rahul   Production   35   55000 2016-04-12
1    102    Amit  Maintenance   42   62000 2014-09-23
2    103   Sneha      Quality   29   48000 2019-01-15
3    104   Pooja   Production   31   51000 2018-07-30
4    105  Vikram    Logistics   45   68000 2012-11-02
5    106    Neha      Quality   27   45000 2020-06-18

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       6 non-null      int64
 1   Name        6 non-null      object
 2   Department  6 non-null      object
 3   Age         6 non-null      int64
 4   Salary      6 non-null      int64
 5   JoinDate    6 non-null      datetime64[ns]
dtypes: datetime64[ns](1), int64(3), object(2)
memory usage: 420.0+ bytes

In [27]:
df

   EmpID    Name   Department  Age  Salary   JoinDate
0    101   Rahul   Production   35   55000 2016-04-12
1    102    Amit  Maintenance   42   62000 2014-09-23
2    103   Sneha      Quality   29   48000 2019-01-15
3    104   Pooja   Production   31   51000 2018-07-30
4    105  Vikram    Logistics   45   68000 2012-11-02
5    106    Neha      Quality   27   45000 2020-06-18

In [29]:
df[(df["Department"].isin(["Production","Quality"]) & (df["Name"].str.endswith("a")))]

   EmpID   Name  Department  Age  Salary   JoinDate
2    103  Sneha     Quality   29   48000 2019-01-15
3    104  Pooja  Production   31   51000 2018-07-30
5    106   Neha     Quality   27   45000 2020-06-18

In [32]:
df_new = pd.read_csv('employees.csv')

In [33]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       6 non-null      int64
 1   Name        6 non-null      object
 2   Department  6 non-null      object
 3   Age         6 non-null      int64
 4   Salary      6 non-null      int64
 5   JoinDate    6 non-null      object
dtypes: int64(3), object(3)
memory usage: 420.0+ bytes

In [35]:
df[(df["JoinDate"]>"2018-03-01") & (df["JoinDate"]<"2022-03-31")]

   EmpID   Name  Department  Age  Salary   JoinDate
2    103  Sneha     Quality   29   48000 2019-01-15
3    104  Pooja  Production   31   51000 2018-07-30
5    106   Neha     Quality   27   45000 2020-06-18

In [36]:
df.sort_values(by="JoinDate",ascending=True)

   EmpID    Name   Department  Age  Salary   JoinDate
4    105  Vikram    Logistics   45   68000 2012-11-02
1    102    Amit  Maintenance   42   62000 2014-09-23
0    101   Rahul   Production   35   55000 2016-04-12
3    104   Pooja   Production   31   51000 2018-07-30
2    103   Sneha      Quality   29   48000 2019-01-15
5    106    Neha      Quality   27   45000 2020-06-18

In [39]:
len(df)

6

In [42]:
df.loc[len(df)] = {
    "EmpID": 107,
    "Name": "Manish",
    "Department": "Logistics",
    "Age": 45,
    "Salary": 78000,
    "JoinDate": "2025-10-02 00:00:00"
}

In [43]:
df

   EmpID    Name   Department  Age  Salary             JoinDate
0    101   Rahul   Production   35   55000  2016-04-12 00:00:00
1    102    Amit  Maintenance   42   62000  2014-09-23 00:00:00
2    103   Sneha      Quality   29   48000  2019-01-15 00:00:00
3    104   Pooja   Production   31   51000  2018-07-30 00:00:00
4    105  Vikram    Logistics   45   68000  2012-11-02 00:00:00
5    106    Neha      Quality   27   45000  2020-06-18 00:00:00
6    107  Manish    Logistics   45   78000           2025-10-02
7    107  Manish    Logistics   45   78000  2025-10-02 00:00:00

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   EmpID       8 non-null      int64
 1   Name        8 non-null      object
 2   Department  8 non-null      object
 3   Age         8 non-null      int64
 4   Salary      8 non-null      int64
 5   JoinDate    8 non-null      object
dtypes: int64(3), object(3)
memory usage: 448.0+ bytes

In [46]:
df.sort_values(by="JoinDate",ascending=True)

TypeError: '<' not supported between instances of 'str' and 'Timestamp'

In [47]:
df.loc[6]

EmpID                107
Name              Manish
Department     Logistics
Age                   45
Salary             78000
JoinDate      2025-10-02
Name: 6, dtype: object

In [48]:
df.loc[6][2]

/tmp/ipykernel_2207/1648126032.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[6][2]

'Logistics'

In [50]:
df.loc[6][5]="2025-10-02 10:00:00"

/tmp/ipykernel_2207/2963282987.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[6][5]="2025-10-02 10:00:00"
/tmp/ipykernel_2207/2963282987.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.loc[6][5]="2025-10-02 10:00:00"

In [51]:
df.loc[6][5]

/tmp/ipykernel_2207/2144239396.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[6][5]

'2025-10-02'

In [52]:
df["JoinDate"]

0    2016-04-12 00:00:00
1    2014-09-23 00:00:00
2    2019-01-15 00:00:00
3    2018-07-30 00:00:00
4    2012-11-02 00:00:00
5    2020-06-18 00:00:00
6             2025-10-02
7    2025-10-02 00:00:00
Name: JoinDate, dtype: object

In [58]:
df.dtypes

EmpID                  int64
Name                  object
Department            object
Age                    int64
Salary                 int64
JoinDate      datetime64[ns]
dtype: object

In [54]:
df["JoinDate"]=pd.to_datetime(df["JoinDate"])

In [55]:
df

   EmpID    Name   Department  Age  Salary   JoinDate
0    101   Rahul   Production   35   55000 2016-04-12
1    102    Amit  Maintenance   42   62000 2014-09-23
2    103   Sneha      Quality   29   48000 2019-01-15
3    104   Pooja   Production   31   51000 2018-07-30
4    105  Vikram    Logistics   45   68000 2012-11-02
5    106    Neha      Quality   27   45000 2020-06-18
6    107  Manish    Logistics   45   78000 2025-10-02
7    107  Manish    Logistics   45   78000 2025-10-02

In [56]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7     True
dtype: bool

In [59]:
df.loc[6, "JoinDate"]

Timestamp('2025-10-02 00:00:00')

In [61]:
df.loc[6][5]

/tmp/ipykernel_2207/2144239396.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[6][5]

Timestamp('2025-10-02 00:00:00')

In [62]:
df.iloc[6][5]

/tmp/ipykernel_2207/2995865776.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[6][5]

Timestamp('2025-10-02 00:00:00')

In [63]:
df.sort_values("Salary",ascending=False)

   EmpID    Name   Department  Age  Salary   JoinDate
6    107  Manish    Logistics   45   78000 2025-10-02
7    107  Manish    Logistics   45   78000 2025-10-02
4    105  Vikram    Logistics   45   68000 2012-11-02
1    102    Amit  Maintenance   42   62000 2014-09-23
0    101   Rahul   Production   35   55000 2016-04-12
3    104   Pooja   Production   31   51000 2018-07-30
2    103   Sneha      Quality   29   48000 2019-01-15
5    106    Neha      Quality   27   45000 2020-06-18

In [68]:
df.sort_values("Salary",ascending=False).groupby("Department").head()

   EmpID    Name   Department  Age  Salary   JoinDate
6    107  Manish    Logistics   45   78000 2025-10-02
7    107  Manish    Logistics   45   78000 2025-10-02
4    105  Vikram    Logistics   45   68000 2012-11-02
1    102    Amit  Maintenance   42   62000 2014-09-23
0    101   Rahul   Production   35   55000 2016-04-12
3    104   Pooja   Production   31   51000 2018-07-30
2    103   Sneha      Quality   29   48000 2019-01-15
5    106    Neha      Quality   27   45000 2020-06-18

In [70]:
df["SalaryRank"]=df.groupby("Department")["Salary"].rank(method="dense",ascending=False)

In [72]:
df[["Salary","SalaryRank"]]

   Salary  SalaryRank
0   55000         1.0
1   62000         1.0
2   48000         1.0
3   51000         2.0
4   68000         2.0
5   45000         2.0
6   78000         1.0
7   78000         1.0

In [73]:
df.sort_values(by=["Department","SalaryRank"])

   EmpID    Name   Department  Age  Salary   JoinDate  SalaryRank
6    107  Manish    Logistics   45   78000 2025-10-02         1.0
7    107  Manish    Logistics   45   78000 2025-10-02         1.0
4    105  Vikram    Logistics   45   68000 2012-11-02         2.0
1    102    Amit  Maintenance   42   62000 2014-09-23         1.0
0    101   Rahul   Production   35   55000 2016-04-12         1.0
3    104   Pooja   Production   31   51000 2018-07-30         2.0
2    103   Sneha      Quality   29   48000 2019-01-15         1.0
5    106    Neha      Quality   27   45000 2020-06-18         2.0

In [74]:
df

   EmpID    Name   Department  Age  Salary   JoinDate  SalaryRank
0    101   Rahul   Production   35   55000 2016-04-12         1.0
1    102    Amit  Maintenance   42   62000 2014-09-23         1.0
2    103   Sneha      Quality   29   48000 2019-01-15         1.0
3    104   Pooja   Production   31   51000 2018-07-30         2.0
4    105  Vikram    Logistics   45   68000 2012-11-02         2.0
5    106    Neha      Quality   27   45000 2020-06-18         2.0
6    107  Manish    Logistics   45   78000 2025-10-02         1.0
7    107  Manish    Logistics   45   78000 2025-10-02         1.0

In [76]:
df.sort_values(["Department","Age"])

   EmpID    Name   Department  Age  Salary   JoinDate  SalaryRank
4    105  Vikram    Logistics   45   68000 2012-11-02         2.0
6    107  Manish    Logistics   45   78000 2025-10-02         1.0
7    107  Manish    Logistics   45   78000 2025-10-02         1.0
1    102    Amit  Maintenance   42   62000 2014-09-23         1.0
3    104   Pooja   Production   31   51000 2018-07-30         2.0
0    101   Rahul   Production   35   55000 2016-04-12         1.0
5    106    Neha      Quality   27   45000 2020-06-18         2.0
2    103   Sneha      Quality   29   48000 2019-01-15         1.0

In [78]:
df.sort_values(by=["Department","Age"],ascending=[False,True])

   EmpID    Name   Department  Age  Salary   JoinDate  SalaryRank
5    106    Neha      Quality   27   45000 2020-06-18         2.0
2    103   Sneha      Quality   29   48000 2019-01-15         1.0
3    104   Pooja   Production   31   51000 2018-07-30         2.0
0    101   Rahul   Production   35   55000 2016-04-12         1.0
1    102    Amit  Maintenance   42   62000 2014-09-23         1.0
4    105  Vikram    Logistics   45   68000 2012-11-02         2.0
6    107  Manish    Logistics   45   78000 2025-10-02         1.0
7    107  Manish    Logistics   45   78000 2025-10-02         1.0

In [80]:
df["JoiningRank"] =df["JoinDate"].rank()

In [81]:
df

   EmpID    Name   Department  Age  Salary   JoinDate  SalaryRank  JoiningRank
0    101   Rahul   Production   35   55000 2016-04-12         1.0          3.0
1    102    Amit  Maintenance   42   62000 2014-09-23         1.0          2.0
2    103   Sneha      Quality   29   48000 2019-01-15         1.0          5.0
3    104   Pooja   Production   31   51000 2018-07-30         2.0          4.0
4    105  Vikram    Logistics   45   68000 2012-11-02         2.0          1.0
5    106    Neha      Quality   27   45000 2020-06-18         2.0          6.0
6    107  Manish    Logistics   45   78000 2025-10-02         1.0          7.5
7    107  Manish    Logistics   45   78000 2025-10-02         1.0          7.5

In [82]:
df["JoiningRank1"]=df["JoinDate"].rank(method="dense")
df

,EmpID,Name,Department,Age,Salary,JoinDate,SalaryRank,JoiningRank,JoiningRank1
0,101,Rahul,Production,35,55000,2016-04-12,1.0,3.0,3.0
1,102,Amit,Maintenance,42,62000,2014-09-23,1.0,2.0,2.0
2,103,Sneha,Quality,29,48000,2019-01-15,1.0,5.0,5.0
3,104,Pooja,Production,31,51000,2018-07-30,2.0,4.0,4.0
4,105,Vikram,Logistics,45,68000,2012-11-02,2.0,1.0,1.0
5,106,Neha,Quality,27,45000,2020-06-18,2.0,6.0,6.0
6,107,Manish,Logistics,45,78000,2025-10-02,1.0,7.5,7.0
7,107,Manish,Logistics,45,78000,2025-10-02,1.0,7.5,7.0

In [83]:
df["JoiningRank1"]=df["JoinDate"].rank(method="min")
df

,EmpID,Name,Department,Age,Salary,JoinDate,SalaryRank,JoiningRank,JoiningRank1
0,101,Rahul,Production,35,55000,2016-04-12,1.0,3.0,3.0
1,102,Amit,Maintenance,42,62000,2014-09-23,1.0,2.0,2.0
2,103,Sneha,Quality,29,48000,2019-01-15,1.0,5.0,5.0
3,104,Pooja,Production,31,51000,2018-07-30,2.0,4.0,4.0
4,105,Vikram,Logistics,45,68000,2012-11-02,2.0,1.0,1.0
5,106,Neha,Quality,27,45000,2020-06-18,2.0,6.0,6.0
6,107,Manish,Logistics,45,78000,2025-10-02,1.0,7.5,7.0
7,107,Manish,Logistics,45,78000,2025-10-02,1.0,7.5,7.0

In [84]:
df["JoiningRank1"]=df["JoinDate"].rank(method="max")
df

,EmpID,Name,Department,Age,Salary,JoinDate,SalaryRank,JoiningRank,JoiningRank1
0,101,Rahul,Production,35,55000,2016-04-12,1.0,3.0,3.0
1,102,Amit,Maintenance,42,62000,2014-09-23,1.0,2.0,2.0
2,103,Sneha,Quality,29,48000,2019-01-15,1.0,5.0,5.0
3,104,Pooja,Production,31,51000,2018-07-30,2.0,4.0,4.0
4,105,Vikram,Logistics,45,68000,2012-11-02,2.0,1.0,1.0
5,106,Neha,Quality,27,45000,2020-06-18,2.0,6.0,6.0
6,107,Manish,Logistics,45,78000,2025-10-02,1.0,7.5,8.0
7,107,Manish,Logistics,45,78000,2025-10-02,1.0,7.5,8.0